; domain
(define (domain housework)

    (:requirements :strips :typing :adl)

    ; Begin types
    (:types
        agent room item - object
        desk appliance - item
    )
    ; End types

    ; Begin predicates
    (:predicates
        (agent_at ?a - agent ?r - room)
        (agent_hand_free ?a - agent)
        (agent_has_item ?a - agent ?i - item)

        (item_at ?i - item ?r - room)
        (item_on ?i - item ?d - desk)
        (item_in ?i - item ?ap - appliance) 

        (item_accessible ?i - item)
        (item_pickable ?i - item)

        (appliance_on ?ap - appliance)
        (appliance_at ?ap - appliance ?r - room)

        (neighbor ?r1 - room ?r2 - room)

        (heated ?i - item)

        (is_microwave ?ap - appliance)
        (is_desk ?d - desk)
    )
    ; End predicates

    ; Begin actions
    (:action goto
        :parameters (?a - agent ?from - room ?to - room)
        :precondition (and
            (agent_at ?a ?from)
            (neighbor ?from ?to)
        )
        :effect (and
            (not (agent_at ?a ?from))
            (agent_at ?a ?to)
        )
    )

    (:action pick_from_room
        :parameters (?a - agent ?i - item ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (item_at ?i ?r)
            (item_accessible ?i)
            (item_pickable ?i)
            (agent_hand_free ?a)
        )
        :effect (and
            (not (item_at ?i ?r))
            (not (agent_hand_free ?a))
            (agent_has_item ?a ?i)
        )
    )

    (:action pick_from_appliance
        :parameters (?a - agent ?i - item ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (agent_hand_free ?a)
            (item_in ?i ?ap)
            (appliance_at ?ap ?r)
            (item_accessible ?i)
            (item_pickable ?i)
        )
        :effect (and
            (not (item_in ?i ?ap))
            (not (agent_hand_free ?a))
            (agent_has_item ?a ?i)
        )
    )

    (:action place_on_desk
        :parameters (?a - agent ?i - item ?d - desk ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (not (item_on ?i ?d))
            (agent_has_item ?a ?i)
        )
        :effect (and
            (not (agent_has_item ?a ?i))
            (agent_hand_free ?a)
            (item_on ?i ?d)
        )
    )
    
    (:action place_in_appliance
        :parameters (?a - agent ?i - item ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (not (item_in ?i ?ap))
            (appliance_at ?ap ?r)
            (agent_has_item ?a ?i)
        )
        :effect (and
            (not (agent_has_item ?a ?i))
            (agent_hand_free ?a)
            (item_in ?i ?ap)
        )
    )

    (:action turn_on_appliance
        :parameters (?a - agent ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (appliance_at ?ap ?r)
            (not (appliance_on ?ap))
        )
        :effect (and
            (appliance_on ?ap)
        )
    )

    (:action turn_off_appliance
        :parameters (?a - agent ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (appliance_at ?ap ?r)
            (appliance_on ?ap)
        )
        :effect (and
            (not (appliance_on ?ap))
        )
    )

    (:action wait_heat_food
        :parameters (?a - agent ?i - item ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (item_in ?i ?ap)
            (appliance_at ?ap ?r)
            (is_microwave ?ap)
            (appliance_on ?ap)
            (not (heated ?i))
        )
        :effect (and
            (heated ?i)
        )
    )
    ; End actions
)

; problem
(define (problem home_housework)
    (:domain housework)

    ; Begin objects
    (:objects
        robot - agent
        kitchen bathroom bedroom livingroom - room
        food water_bottle eggs - item
        microwave egg_container - appliance
        desk - desk
    )

    ; Begin init
    (:init
        ; Connections
        (neighbor kitchen livingroom)
        (neighbor livingroom kitchen)

        ; Positions
        (agent_at robot livingroom)
        (agent_hand_free robot)
        (item_at food kitchen)
        (item_at water_bottle kitchen)
        (item_at eggs kitchen)
        (item_at desk livingroom)
        (appliance_at microwave kitchen)
        (appliance_at egg_container kitchen)

        ; Attributes
        (item_accessible food)
        (item_pickable food)
        (item_accessible microwave)
        (item_accessible water_bottle)
        (item_pickable water_bottle)
        (item_accessible eggs)
        (item_pickable eggs)
        (item_accessible egg_container)
        (item_accessible desk)

        (is_microwave microwave)
        (is_desk desk)
    )
    ; End init

    ; Begin goal
    (:goal (and
        (heated food)
        (item_on food desk)
        (item_on water_bottle desk)
        (item_in eggs egg_container)
    ))
    ; End goal
)

; plan
1. (goto robot livingroom kitchen)
   deleted: (agent_at robot livingroom)
   added: (agent_at robot kitchen)
   goals met: 0 of 4
2. (turn_on_appliance robot microwave kitchen)
   added: (appliance_on microwave)
   goals met: 0 of 4
3. (pick_from_room robot food kitchen)
   deleted: (item_at food kitchen) (agent_hand_free robot)
   added: (agent_has_item robot food)
   goals met: 0 of 4
4. (place_in_appliance robot food microwave kitchen)
   deleted: (agent_has_item robot food)
   added: (agent_hand_free robot) (item_in food microwave)
   goals met: 0 of 4
5. (wait_heat_food robot food microwave kitchen)
   added: (heated food)
   goals met: 1 of 4
6. (pick_from_appliance robot food microwave kitchen)
   deleted: (item_in food microwave) (agent_hand_free robot)
   added: (agent_has_item robot food)
   goals met: 1 of 4
7. (place_on_desk robot food desk kitchen)
   deleted: (agent_has_item robot food)
   added: (agent_hand_free robot) (item_on food desk)
   goals met: 2 of 4
8. (pick_from_room robot water_bottle kitchen)
   deleted: (item_at water_bottle kitchen) (agent_hand_free robot)
   added: (agent_has_item robot water_bottle)
   goals met: 2 of 4
9. (place_on_desk robot water_bottle desk kitchen)
   deleted: (agent_has_item robot water_bottle)
   added: (agent_hand_free robot) (item_on water_bottle desk)
   goals met: 3 of 4
10. (pick_from_room robot eggs kitchen)
   deleted: (item_at eggs kitchen) (agent_hand_free robot)
   added: (agent_has_item robot eggs)
   goals met: 3 of 4
11. (place_in_appliance robot eggs egg_container kitchen)
   deleted: (agent_has_item robot eggs)
   added: (agent_hand_free robot) (item_in eggs egg_container)
   goals met: 4 of 4
